import React from 'react'

const DetailMe = () => {
  return (
    <div className="detail">
      <div>
        <h4 className="aboutPage-title">- 自己PR -</h4>
        <p className="detail-font">
        　私は前職でECサイトを運営する会社に勤めており、EC業界、物流業界の知識と経験があります。<br/>
        <br/>
        　前職での具体的な業務内容としては、パートの従業員の方のマネジメントを行いながら、ECサイト（楽天、Amazon、Yahoo!等）の運営や倉庫内の環境改善、物流業者との均衡などを行っておりました。<br/>
        　パートの従業員が抱えている問題についてヒアリングする機会を設けたり、コミュニケーションを多く取ることで雰囲気が良くなり、お互いをフォローし合う良好な人間関係を構築できました。<br/>
        　忙しい職場でしたが、従業員全員が笑顔で働いている姿を見て、とてもやりがいを感じておりました。<br/>
        <br/>
        　また、私は今年30歳になります。<br/>
        　30代で未経験の業界、特に技術職であるエンジニアに転職をするということは、難しいという認識でいます。<br/>
        　危機感を感じつつも「楽しい」と感じながら、日々プログラミング学習に向き合っています。<br/>
        <br/>
        　就職後も継続して平日の夜や休日にもプログラミング学習を行い、技術へのキャッチアップに取り組み続けることをお約束いたします。</p>
      </div>
      
      <div>
        <h4 className="aboutPage-title">- なぜエンジニアになりたいと思ったか -</h4>
        <p className="detail-font">
        　プログラミングに関心を持ったきっかけは、前職で使用していた注文管理や在庫管理を行うシステムに不具合が多く、「これを改善できたらもっと業務の効率が上がるのに」「もっとこういう機能があったら良いのに」と感じたことでした。<br/><br/>
        　具体的には、注文をいただいた商品を在庫と引き当てる処理にエラーが発生すること、注文を管理システムに取り込む際に毎回確認作業が発生すること、倉庫内の在庫とWebサイト上の在庫を連動することができないことなどです。<br/><br/>
        　以上のような問題点を発見したり、より良くなるアイデアが思いたりするものの、自分の力でシステムの改善をすることができず、とてももどかしい気持ちで働いていました。<br/><br/>
        　現在は自分の中にある「何かを改善するためのアイデア」を実際に形にし、自分がこれまで感じてきた不便を解決し多くの人に価値を提供するための手段として、プログラミング学習に励んでいます。</p>
      </div>
      
      <div>
        <h4 className="aboutPage-title">- 略歴 -</h4>
        <p className="career">
        2007.04 - 2009.03　岩手県立宮古高等学校 卒業<br/>
        2009.04 - 2011.03　国立山形大学 工学部 応用生命システム工学科 中退<br/>
        2011.04 - 2013.03　専門学校ミューズ音楽院 ミキシングクリエーター専攻 卒業<br/>
        2013.03 - 2015.04　音楽活動（リリース、ワンマンライブ、東名阪ツアーなどを行う）<br/>
        2015.05 - 2015.10　株式会社あとらす二十一 （Webディレクター）<br/>
        2016.03 - 2020.06　株式会社 ASJコマース （副主任）<br/>
        2020.06 - 2020.08　TECH::CAMPにてプログラミング学習<br/>
        2020.09 -　　　　　学習を継続しつつ、転職活動中
        </p>
      </div>
    </div>
  )
}

export default DetailMe